export default function openModal(type) {

  const modalWindow = document.createElement('div');
  modalWindow.classList.add('modal');
  modalWindow.setAttribute('data-modal', '');

  if (type == 'request-call') {
    modalWindow.classList.add('modal--request-call');
    modalWindow.innerHTML = `
      <div class="modal-wrapper">
        <button class="modal__close-btn" data-modal="close">
          <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M0.46967 10.4697C0.176777 10.7626 0.176777 11.2374 0.46967 11.5303C0.762563 11.8232 1.23744 11.8232 1.53033 11.5303L0.46967 10.4697ZM6.53033 6.53033C6.82322 6.23744 6.82322 5.76256 6.53033 5.46967C6.23744 5.17678 5.76256 5.17678 5.46967 5.46967L6.53033 6.53033ZM5.46967 5.46967C5.17678 5.76256 5.17678 6.23744 5.46967 6.53033C5.76256 6.82322 6.23744 6.82322 6.53033 6.53033L5.46967 5.46967ZM11.5303 1.53033C11.8232 1.23744 11.8232 0.762563 11.5303 0.46967C11.2374 0.176777 10.7626 0.176777 10.4697 0.46967L11.5303 1.53033ZM6.53033 5.46967C6.23744 5.17678 5.76256 5.17678 5.46967 5.46967C5.17678 5.76256 5.17678 6.23744 5.46967 6.53033L6.53033 5.46967ZM10.4697 11.5303C10.7626 11.8232 11.2374 11.8232 11.5303 11.5303C11.8232 11.2374 11.8232 10.7626 11.5303 10.4697L10.4697 11.5303ZM5.46967 6.53033C5.76256 6.82322 6.23744 6.82322 6.53033 6.53033C6.82322 6.23744 6.82322 5.76256 6.53033 5.46967L5.46967 6.53033ZM1.53033 0.46967C1.23744 0.176777 0.762563 0.176777 0.46967 0.46967C0.176777 0.762563 0.176777 1.23744 0.46967 1.53033L1.53033 0.46967ZM1.53033 11.5303L6.53033 6.53033L5.46967 5.46967L0.46967 10.4697L1.53033 11.5303ZM6.53033 6.53033L11.5303 1.53033L10.4697 0.46967L5.46967 5.46967L6.53033 6.53033ZM5.46967 6.53033L10.4697 11.5303L11.5303 10.4697L6.53033 5.46967L5.46967 6.53033ZM6.53033 5.46967L1.53033 0.46967L0.46967 1.53033L5.46967 6.53033L6.53033 5.46967Z" fill="#505567"/>
          </svg>										
        </button>
        <h3 class="modal__title">Замовити дзвінок</h3>
        <div class="modal__text">Залишіть свій номер телефону і найближчим часом ми вам передзвонимо</div>
        <form class="modal-form">
          <div class="modal__input-wrapper">
            <label class="modal__label" for="phone">Телефон</label>
            <input class="modal__input modal__input--phone" type="text" id="phone" name="phone" placeholder="+38 (0__) ___ - __ - __">
          </div>
          <button class="modal__send-btn btn-blue btn-blue--full" type="submit">Надіслати</button>
        </form>
      </div>
    `;

  }

  if (type == 'reviews-all') {
    modalWindow.classList.add('modal--reviews');
    modalWindow.innerHTML = `
      <div class="modal-wrapper">
        <button class="modal__close-btn" data-modal="close">
          <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M0.46967 10.4697C0.176777 10.7626 0.176777 11.2374 0.46967 11.5303C0.762563 11.8232 1.23744 11.8232 1.53033 11.5303L0.46967 10.4697ZM6.53033 6.53033C6.82322 6.23744 6.82322 5.76256 6.53033 5.46967C6.23744 5.17678 5.76256 5.17678 5.46967 5.46967L6.53033 6.53033ZM5.46967 5.46967C5.17678 5.76256 5.17678 6.23744 5.46967 6.53033C5.76256 6.82322 6.23744 6.82322 6.53033 6.53033L5.46967 5.46967ZM11.5303 1.53033C11.8232 1.23744 11.8232 0.762563 11.5303 0.46967C11.2374 0.176777 10.7626 0.176777 10.4697 0.46967L11.5303 1.53033ZM6.53033 5.46967C6.23744 5.17678 5.76256 5.17678 5.46967 5.46967C5.17678 5.76256 5.17678 6.23744 5.46967 6.53033L6.53033 5.46967ZM10.4697 11.5303C10.7626 11.8232 11.2374 11.8232 11.5303 11.5303C11.8232 11.2374 11.8232 10.7626 11.5303 10.4697L10.4697 11.5303ZM5.46967 6.53033C5.76256 6.82322 6.23744 6.82322 6.53033 6.53033C6.82322 6.23744 6.82322 5.76256 6.53033 5.46967L5.46967 6.53033ZM1.53033 0.46967C1.23744 0.176777 0.762563 0.176777 0.46967 0.46967C0.176777 0.762563 0.176777 1.23744 0.46967 1.53033L1.53033 0.46967ZM1.53033 11.5303L6.53033 6.53033L5.46967 5.46967L0.46967 10.4697L1.53033 11.5303ZM6.53033 6.53033L11.5303 1.53033L10.4697 0.46967L5.46967 5.46967L6.53033 6.53033ZM5.46967 6.53033L10.4697 11.5303L11.5303 10.4697L6.53033 5.46967L5.46967 6.53033ZM6.53033 5.46967L1.53033 0.46967L0.46967 1.53033L5.46967 6.53033L6.53033 5.46967Z" fill="#505567"/>
          </svg>										
        </button>
        <h3 class="modal__title">Відгуки</h3>
        <ul class="modal-review__items">
          
          <li class="review-item">
            <div class="review-item__content">
              <div class="review-item__top">
                <div class="review-item__starrating" data-rating="5">
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                </div>
                <div class="review-item__name">Юлія Горобець</div>
                <div class="review-item__text">
                  Хочу висловити свою подяку колективу, за чудову роботу та професіоналізм! Замовляю вже 3 разів і щоразу це повне захоплення! Букети красиві, квіточки свіжі, довго стоять! Замовляла і готові та збирав за своїм бажанням-все чудово! Дякую Roseshop - ви той випадок, коли точно знаєш куди повертатися за квіточками.
                </div>
              </div>
              <div class="review-item__bottom">
                <div class="review-item__bouquet">Відгук про букет:&ensp;<a href="#">Троянди 80 см</a></div>
              </div>
            </div>
          
            <div class="review-item__img">
              <img src="./img/reviews/people/1.jpg" alt="review icon">
            </div>
          </li>
          
          <li class="review-item">
            <div class="review-item__content">
              <div class="review-item__top">
                <div class="review-item__starrating" data-rating="4">
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                </div>
                <div class="review-item__name">Oksana Sydorovych</div>
                <div class="review-item__text">
                  Просто казкові букети! Гармонійні, зроблені з увагою до деталей - відчувається любов до своєї справи  Постійний хороший настрій гарантовано  Хоч і раніше користувався послугами флористів, та тут як справжнє откровення було. Є от букети, а є букети від Roseshop. Взагалі з іншої ліги! 
                </div>
              </div>
              <div class="review-item__bottom">
                <div class="review-item__bouquet">Відгук про букет:&ensp;<a href="#">25 троянд Ніжний мікс</a></div>
              </div>
            </div>
          
            <div class="review-item__img">
              <img src="./img/reviews/people/2.jpg" alt="review icon">
            </div>
          </li>
          
          <li class="review-item">
            <div class="review-item__content">
              <div class="review-item__top">
                <div class="review-item__starrating" data-rating="5">
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                </div>
                <div class="review-item__name">Olena Levchuk</div>
                <div class="review-item__text">
                  Шикарні квіти, які дарують чарівний настрій))) букети зберігають свою красу більше тижня!) дякуємо за душевність та індивідуальний підхід, які ви вкладаєте в свої творіння.
                </div>
              </div>
              <div class="review-item__bottom">
                <div class="review-item__bouquet">Відгук про букет:&ensp;<a href="#">Ред наомі 60 см</a></div>
              </div>
            </div>
          
            <div class="review-item__img">
              <img src="./img/reviews/people/3.jpg" alt="review icon">
            </div>
          </li>
          
          <li class="review-item">
            <div class="review-item__content">
              <div class="review-item__top">
                <div class="review-item__starrating" data-rating="5">
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                </div>
                <div class="review-item__name">Іра Мокра</div>
                <div class="review-item__text">
                  Хотіла написати,щось про Вас,але настільки в захваті,що не можу підібрати слів. Я дуже гурман у справах флористичних,Ви задовільнили всі мої побажання,та ще й в рази перевершили їх:)
                </div>
              </div>
              <div class="review-item__bottom">
                <div class="review-item__bouquet">Відгук про букет:&ensp;<a href="#">Троянда "Мондіаль" з евкаліптом</a></div>
              </div>
            </div>
          
            <div class="review-item__img">
              <img src="./img/reviews/people/4.jpg" alt="review icon">
            </div>
          </li>
          
          <li class="review-item">
            <div class="review-item__content">
              <div class="review-item__top">
                <div class="review-item__starrating" data-rating="5">
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                  <div class="star">
                    <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M9.849 4.52013L8 1.00513L6.151 4.52013C6.02038 4.77699 5.83131 4.99962 5.599 5.17013C5.36556 5.34151 5.09543 5.4562 4.81 5.50513L1 6.25213L3.66 9.43313C4.02377 9.83181 4.19542 10.3694 4.13 10.9051L3.624 15.0051L7.132 13.3051C7.40262 13.1741 7.69931 13.1057 8 13.1051C8.28212 13.106 8.5599 13.1746 8.81 13.3051L12.4 14.9001L11.894 10.8491C11.83 10.3146 12.002 9.77868 12.365 9.38113L15 6.25213L11.19 5.50513C10.9042 5.45635 10.6337 5.34165 10.4 5.17013C10.1681 4.9995 9.97934 4.77688 9.849 4.52013Z" fill="white" stroke="#FFA500" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>												
                  </div>
                </div>
                <div class="review-item__name">Анна Аврашова</div>
                <div class="review-item__text">
                  Круто, що є така можливість – привітати дорогу людину на відстані! Кур'єр приїхав уранці, як і залишили у заявці. Листівку підписали. Замовлення швидке і чітке, враховуючи, що містечко маленьке. Велике дякую)
                </div>
              </div>
              <div class="review-item__bottom">
                <div class="review-item__bouquet">Відгук про букет:&ensp;<a href="#">5 піоноподібних троянд Місті баблс</a></div>
              </div>
            </div>
          
            <div class="review-item__img">
              <img src="./img/reviews/people/5.jpg" alt="review icon">
            </div>
          </li>

        </ul>
      </div>
    `;

  }

  document.body.appendChild(modalWindow);
  setTimeout(() => {
    modalWindow.classList.add('active');
  }, 10);
}
